chapters = [
    {
        "title": "第1章_操作系统引论",
        "sections": [
            {"title": "1.1_操作系统的目标和作用", "start": 12, "end": 16},
            {"title": "1.2_操作系统的发展过程", "start": 16, "end": 24},
            {"title": "1.3_操作系统的基本特性", "start": 24, "end": 27},
            {"title": "1.4_操作系统的主要功能", "start": 27, "end": 33},
            {"title": "1.5_OS结构设计", "start": 33, "end": 42},
        ]
    },
    {
        "title": "第2章_进程的描述与控制",
        "sections": [
            {"title": "2.1_前趋图和程序执行", "start": 43, "end": 46},
            {"title": "2.2_进程的描述", "start": 46, "end": 53},
            {"title": "2.3_进程控制", "start": 53, "end": 58},
            {"title": "2.4_进程同步", "start": 58, "end": 71},
            {"title": "2.5_经典进程的同步问题", "start": 71, "end": 78},
            {"title": "2.6_进程通信", "start": 78, "end": 86},
            {"title": "2.7_线程的基本概念", "start": 86, "end": 90},
            {"title": "2.8_线程的实现", "start": 90, "end": 95},
        ]
    },
    {
        "title": "第3章_处理机调度与死锁",
        "sections": [
            {"title": "3.1_处理机调度的层次和调度算法的目标", "start": 96, "end": 98},
            {"title": "3.2_作业与作业调度", "start": 98, "end": 102},
            {"title": "3.3_进程调度", "start": 102, "end": 108},
            {"title": "3.4_实时调度", "start": 108, "end": 115},
            {"title": "3.5_死锁概述", "start": 115, "end": 119},
            {"title": "3.6_预防死锁", "start": 119, "end": 121},
            {"title": "3.7_避免死锁", "start": 121, "end": 126},
            {"title": "3.8_死锁的检测与解除", "start": 126, "end": 129},
        ]
    },
    {
        "title": "第4章_存储器管理",
        "sections": [
            {"title": "4.1_存储器的层次结构", "start": 131, "end": 133},
            {"title": "4.2_程序的装入和链接", "start": 133, "end": 137},
            {"title": "4.3_连续分配存储管理方式", "start": 137, "end": 146},
            {"title": "4.4_对换(Swapping)", "start": 146, "end": 149},
            {"title": "4.5_分页存储管理方式", "start": 149, "end": 156},
            {"title": "4.6_分段存储管理方式", "start": 156, "end": 163},
        ]
    },
    {
        "title": "第5章_虚拟存储器",
        "sections": [
            {"title": "5.1_虚拟存储器概述", "start": 164, "end": 168},
            {"title": "5.2_请求分页存储管理方式", "start": 168, "end": 173},
            {"title": "5.3_页面置换算法", "start": 173, "end": 180},
            {"title": "5.4_抖动与工作集", "start": 180, "end": 183},
            {"title": "5.5_请求分段存储管理方式", "start": 183, "end": 188},
        ]
    },
    {
        "title": "第6章_输入输出系统",
        "sections": [
            {"title": "6.1_IO系统的功能、模型和接口", "start": 189, "end": 194},
            {"title": "6.2_IO设备和设备控制器", "start": 194, "end": 200},
            {"title": "6.3_中断机构和中断处理程序", "start": 200, "end": 203},
            {"title": "6.4_设备驱动程序", "start": 203, "end": 209},
            {"title": "6.5_与设备无关的IO软件", "start": 209, "end": 215},
            {"title": "6.6_用户层的IO软件", "start": 215, "end": 219},
            {"title": "6.7_缓冲区管理", "start": 219, "end": 225},
            {"title": "6.8_磁盘存储器的性能和调度", "start": 225, "end": 231},
        ]
    },
    {
        "title": "第7章_文件管理",
        "sections": [
            {"title": "7.1_文件的和文件系统", "start": 232, "end": 237},
            {"title": "7.2_文件的逻辑结构", "start": 237, "end": 243},
            {"title": "7.3_文件目录", "start": 243, "end": 251},
            {"title": "7.4_文件共享", "start": 251, "end": 254},
            {"title": "7.5_文件保护", "start": 254, "end": 260},
        ]
    },
    {
        "title": "第8章_磁盘存储器的管理",
        "sections": [
            {"title": "8.1_外存的组织方式", "start": 261, "end": 270},
            {"title": "8.2_文件存储空间的管理", "start": 270, "end": 274},
            {"title": "8.3_提高磁盘I/O速度的途径", "start": 274, "end": 278},
            {"title": "8.4_提高磁盘可靠性的技术", "start": 278, "end": 283},
            {"title": "8.5_数据一致性控制", "start": 283, "end": 287},
        ]
    },
    {
        "title": "第9章_操作系统接口",
        "sections": [
            {"title": "9.1_用户接口", "start": 289, "end": 293},
            {"title": "9.2_Shell命令语言", "start": 293, "end": 299},
            {"title": "9.3_联机命令接口的实现", "start": 299, "end": 304},
            {"title": "9.4_系统调用的概念和类型", "start": 304, "end": 308},
            {"title": "9.4_UNIX系统调用", "start": 308, "end": 311},
            {"title": "9.4_系统调用的实现", "start": 311, "end": 317},

        ]
    },
    {
        "title": "第10章_多处理机操作系统",
        "sections": [
            {"title": "10.1_多处理机系统的基本概念", "start": 318, "end": 320},
            {"title": "10.2_多处理机系统的结构", "start": 320, "end": 326},
            {"title": "10.3_多处理机操作系统的特征与分类", "start": 326, "end": 330},
            {"title": "10.4_进程同步", "start": 330, "end": 337},
            {"title": "10.5_多处理机操作系统的进程调度", "start": 337, "end": 344},
            {"title": "10.6_网络操作系统", "start": 344, "end": 350},
            {"title": "10.7_分布式文件系统", "start": 350, "end": 358},
        ]
    },
    {
        "title": "第11章_多媒体操作系统",
        "sections": [
            {"title": "11.1_多媒体系统简介", "start": 359, "end": 364},
            {"title": "11.2_多媒体文件中的各种媒体", "start": 364, "end": 368},
            {"title": "11.3_多媒体进程管理中的问题和接纳控制", "start": 368, "end": 372},
            {"title": "11.4_多媒体实时调度", "start": 372, "end": 376},
            {"title": "11.5_媒体服务器的特征和接纳控制", "start": 376, "end": 379},
            {"title": "11.6_多媒体存储器的分配方法", "start": 379, "end": 386},
            {"title": "11.7_高速缓存与磁盘调度", "start": 386, "end": 390},

        ]
    },
    {
        "title": "第12章_保护和安全",
        "sections": [
            {"title": "12.1_安全环境", "start": 391, "end": 394},
            {"title": "12.2_数据加密技术", "start": 394, "end": 398},
            {"title": "12.3_用户验证", "start": 398, "end": 403},
            {"title": "12.4_来自系统内部的攻击", "start": 403, "end": 407},
            {"title": "12.5_来自系统外部的攻击", "start": 407, "end": 412},
            {"title": "12.6_可信系统(Trusted System)", "start": 412, "end": 417},
        ]
    }
]
